app/controllers/events_controller.rb

INSERT INTO "events" ("address", "title", "description", "time", "date", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_event
      @event = Event.find_by_id(params[:id])